; -----------------------------------------------------------------------------
;
; Universal Extractor Language File
; Written for Universal Extractor 1.6
; Author:	Leonardo Mauro <lmauro@keko.com.ar> / Mario Бngel <marioangel70@gmail.com>
; Homepage:	http://www.tatinweb.com.ar
;
; Translation Instructions:
;	Copy this file to a new file named after the new language
;		Eg: A language file for the German language would be named German.ini.
;	Replace the English words and phrases with their native equivalents,
;		attempting to match the English phrasing and case-sensitivity as
;		closely as possible for the sake of consistency
;	Update the Author and Homepage information at the top of your new language
;		file.  Simply delete the Homepage line if you don't have one.
;	Save the file in Unicode (UTF-8) format and Zip it to preserve formatting
;	E-mail new language files to jbreland@legroom.net for inclusion in main
;		Universal Extractor installer
;
;	The following symbols have special meanings:
;	& - when used in a GUI label or button, it precedes the letter that will
;		be registered as a "hotkey" for that function
;	%n - indicates a newline character, which will be replaced when displayed
;	%t - indicates a tab character, which will be replaced when displayed
;	%s - indicates a string variable that UniExtract will replace when displayed
;		The contents each %s variables is hardocded into UniExtract.
;		The order and number of %s variables is very important and should not
;		be modified.
;
; -----------------------------------------------------------------------------

[UniExtract]
; GUI labels and buttons
OK_BUT = "&Aceptar"
CANCEL_BUT = "&Cancelar"
MAIN_DEST_DIR_LABEL = "Ca&rpeta destino:"
MAIN_FILE_LABEL = "&Archivo/Instalador a extraer:"
MENU_FILE_LABEL = "A&rchivo"
MENU_FILE_QUIT_LABEL = "&Salir"
MENU_EDIT_LABEL = "&Editar"
MENU_EDIT_PREFS_LABEL = "&Preferencias"
MENU_HELP_LABEL = "A&yuda"
MENU_HELP_WEB_LABEL = "Sitio &Web de %s"
PREFS_TITLE_LABEL = "Preferencias"
PREFS_UNIEXTRACT_OPTS_LABEL = "Opciones de Universal Extractor"
PREFS_HISTORY_LABEL = "Mantener registro del &historial"
PREFS_FORMAT_OPTS_LABEL = "Opciones de Formato-Especнfico"
PREFS_LANG_LABEL = "&Idioma"
PREFS_DEBUG_LABEL = "Carpeta de archivos de &Depuraciуn:"
PREFS_WARN_EXECUTE_LABEL = "&Advertir antes de ejecutar archivos"
PREFS_REMOVE_DUPE_LABEL = "Elimina&r archivos duplicados"
PREFS_REMOVE_TEMP_LABEL = "Eliminar archivos &temporales
PREFS_APPEND_EXT_LABEL = "A&сadir extensiones desaparecidas"
METHOD_ADMIN_RADIO = "%s Instalador Administrativo"
METHOD_EXTRACTION_RADIO = "%s extracciуn"
METHOD_HEADER = "Extracciуn del %s"
METHOD_MSI_NOTE_LABEL = "Nota:"
METHOD_MSI_REQUIRES_LABEL = "Necesita el msi2xml"
METHOD_MSI_URL_LABEL = "Procesador MSXML 4.0"
METHOD_RADIO_LABEL = "Mйtodo de extracciуn"
METHOD_SWITCH_RADIO = "%s Interconector"
METHOD_NOTIS_RADIO = "No es un instalador InstallShield"
METHOD_TEXT_LABEL = ""%s soporta los siguientes mйtodos para extracciуn %s de paquetes.  Desafortunadamente, ninguno de estos mйtodos son 100% confiables. Si el mйtodo predefinido no funciona por favor, vuelva a utilizar %s seleccionando un mйtodo alternativo."
METHOD_UNPACKER_RADIO = "%s Descompresor"

; GUI control functions
DOES_NOT_EXIST = "no existe.%n"
EXTRACT_TO = "Extraer en:"
INVALID_DIR_SELECTED =  "%s no es una carpeta vбlida."
INVALID_FILE_SELECTED = "%sPor favor seleccione un archivo vбlido."
OPEN_FILE = "Abrir archivo"
SELECT_FILE = "Seleccionar archivo"
WRITE_TO = "Escribir en:"

; Common terms
TERM_ARCHIVE = "archivo"
TERM_COMPRESSED = "archivo comprimido"
TERM_DISK = "disco"
TERM_EBOOK = "libro electrуnico"
TERM_ECARD = "tarjeta electrуnica"
TERM_ENCODED = "archivo codificado"
TERM_EXECUTABLE = "ejecutable"
TERM_FAILED = "errуneo"
TERM_HELP = "Archivo de ayuda"
TERM_HOTFIX = "revisiуn"
TERM_IMAGE = "imagen"
TERM_INSTALLER = "instalador"
TERM_PACKAGE = "paquete"
TERM_PATCH = "parche"
TERM_SFX = "Autoextraible"
TERM_STAGE = "Estado"
TERM_SUCCEEDED = "realizado"
TERM_TESTING = "Probando"
TERM_UNKNOWN = "desconocido"
TERM_UNPACKED = "descomprimido"
TERM_UPDATER = "actualizador"

; Status messages
SCANNING_FILE = "Analizando para identificar el tipo de archivo."
SCANNING_EXE = "Analizando archivo con %s escбner."
EXTRACTING = "Extraer archivos de:"
INIT_WAIT = "Esperando la inicializaciуn del instalador.%nPor favor, espere."

; Custom prompts
CONVERT_CDROM = "La imagen de CD-ROM BIN/CUE no puede ser extraнda automбticamente. Esta imagen%nserб convertida en una imagen de CD-ROM ISO, la cual podrб ser extraнda.%n%nDesea continuar?%nNota: Este proceso puede tomar varios minutos."
CONVERT_CDROM_STAGE1_FAILED = "Error: La imagen BIN/CUE no puede ser convertida.%nPor favor asegъrese que el archivo CUE estй en el formato correcto."
CONVERT_CDROM_STAGE2_FAILED = "Error: Una imagen ISO ha sido creada a partir de la imagen %s, pero йsta no pudo ser convertida.%nїDesea preservar la imagen ISO para futuros anбlisis?"
CONVERT_BIN_MISSING = "Error: No se encuentra disponible:%n%s\%s.%s%n%nAmbos %s.bin y %s.cue son necesarios."
INIT_COMPLETE = "Inicializaciуn %s. Por favor salga del instalador, y luego presione OK para continuar"
WISE_MSI_PROMPT = "Nota: Este mйtodo solo funciona con algunos paquetes de instalaciуn Wise para Windows.%nSi el asistente del instalador Wise se abre y solo espera instrucciones, este archivo no es%nsoportado. Por favor salga del instalador, e %s interrumpa la extracciуn.%n%nїDesea continuar?"
UNPACK_PROMPT = "Йste archivo estб %s comprimido, pero tal vez pueda ser extraнdo.%nPuede ser porque el formato no es soportado, o %n simplemente porque es un archivo no incluнdo para extracciуn.%n%nїQuiere probar descomprimir йste archivo?%n%nNota: El archivo descomprimido deberб ser llamarse:%n%s\%s_unpacked.%s"
UNPACK_FAILED = "Error: %s%nNo puede ser descomprimido."
WARN_EXECUTE = "Advertencia:  A fin de extraer archivos de este tipo, el archivo debe ejecutarse directamente.%nSi continъa, el comando siguiente se ejecutarб:%n%n%s%n%nSi cree que йste archivo posiblemente pueda ser malicioso, se recomienda que no continъe.%nїDesea continuar con la extracciуn?"

; Help text
HELP_SUMMARY = "Extraer el contenido de cualquier tipo de archivo o paquete de instalaciуn."
HELP_SYNTAX = "%nUso:  %s [/help] [nombrearchivo [destino]]"
HELP_ARGUMENTS = "%n%nOpciones soportadas:"
HELP_HELP = "%n     /help%t%tMostrar la informaciуn de ayuda"
HELP_FILENAME = "%n     nombrearchivo%tNombre del archivo a extraer"
HELP_DESTINATION = "%n     destino%tCarpeta donde extraer"
HELP_SUB = "%n%nPasar /sub en vez de utilizar una carpeta destino%n%s extraer el archivo en una subcarpeta."
HELP_EXAMPLE1 = "%n%nEjemplo:"
HELP_EXAMPLE2 = "%n     %s c:\1\ejemplo.zip c:\test"
HELP_NOARGS = "%n%nEjecutando %s sin opciones se le requerirб%n al usuario el nombre del archivo y carpeta destino."

; Error messages
CANNOT_LOG = "%s la extracciуn no ha podido ser registrada."
CANNOT_DEBUG = "La carpeta de salida del archivo de depuraciуn, "%s", no se puede escribir.%nSe usarб entonces su carpeta temporal."
CANNOT_EXTRACT = "%s no puede ser extraнdo.%nEl tipo de archivo retornado es: %s%n%nElija OK si quiere analizar el archivo, o Cancelar para finalizar."
UNKNOWN_EXT = "%s%nes una extensiуn desconocida y no puede ser extraнda."
INVALID_DIR = "%s%nno puede ser creado. Por favor seleccione un destino vбlido."
EXTRACT_FAILED = "%s no pudo ser extraнdo.%nParece ser un(n) %s, el cual es soportado, pero la extracciуn fallу.%nPor favor lea el archivo de registro (log), %s, para mayor informaciуn.%n%nSeleccione OK para ver el archivo de registro, o Cancelar para finalizar."

[Installer]
; Components page
COMP_DOCS = "Documentaciуn e informaciуn de licencia"
COMP_LANG = "Archivos de Idioma para el soporte de la internacionalizaciуn"
COMP_ACE = "Soporte de archivos ACE"
COMP_KGB = "Soporte de archivos KGB"
COMP_PEA = "Soporte de archivos Pea"
COMP_SIT = "Soporte de archivos StuffIt"

; Preferences page
PREFS_CAPTION = "Opciones del programa"
PREFS_DESCRIPTION = "Que opciones del Universal Extractor desea elegir?"
PREFS_LABEL1 = "Ud. puede elegir las siguientes opciones para predefinir el comportamiento del Universal Extractor."
PREFS_LABEL2 = "Estas opciones pueden ser cambiadas luego de la instalaciуn modificando el archivo UniExtract.ini."
LANGUAGE_LABEL = "Idioma predeterminado"
DEBUG_LABEL = "Ubicaciуn del archivo de depuraciуn"
APPEND_EXT_LABEL = "&Aсadir extensiones desaparecidas"
HISTORY_LABEL = "&Mantener el historial de archivos"
REMOVE_DUPE_LABEL = "Eliminar archivos &duplicados"
REMOVE_TEMP_LABEL = "Eliminar archivos &temporales"
WARN_EXECUTE_LABEL = "Ad&vertir antes de ejecutar archivos"

; Tasks page
ASSOCIATE = "&Habilitar la integraciуn con el menъ del explorador del sistema"
ASSOCIATE_FILES = "Agregar 'Extraer con UniExtract &Archivos...' al menъ contextual"
ASSOCIATE_HERE = "Agregar 'Extraer con UniExtract &Aquн' al menъ contextual"
ASSOCIATE_SUBDIR = "Agregar 'Extraer con UniExtract en la &Subcarpeta' al menъ contextual"
ASSOCIATE_FORCE = "Forzar la&asociaciуn con todos los formatos de archivos soportados"
MODIFY_PATH = "Agregar Universal Extractor a la &ruta de acceso del sistema"
DESKTOP_ICON = "Crear un icono en el &Escritorio"
QUICK_LAUNCH_ICON = "Crear un icono de &Acceso Rбpido"
SENDTO_ICON = "Crear un icono de a E&nviar a"

; Context Menu integration
EXTRACT_FILES = "Extraer &Archivos con UniExtract..."
EXTRACT_HERE = "Extraer &Aquн con UniExtract"
EXTRACT_SUB = "Extraer en la &Subcarpeta con UniExtract"